Bookers/app/controllers/bookers_controller.rb

  def books
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
      # ストロングパラメーターを使用
      book = Book.new(book_params)
      # DBへ保存する
      if book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ああ"], ["body", "あ"], ["created_at", "2020-04-13 09:01:36.215258"], ["updated_at", "2020-04-13 09:01:36.215258"]]

  def update
    book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]